InformationRegisters/АвтоСтатусыПозицийМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АвтоСтатусыПозицийМаршрута</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФакта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПервичныйПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНазначения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтандартЛечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтандартыЛечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЭтапыНазначенийПланаЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЭтапыНазначенийПланаЛечения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтапМаршрутаПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыМаршрутаПациента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтандартЛечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтандартыЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПервичныйПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНазначения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИтогиЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИтогиЛечения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Итог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИтогиДинамическогоКонтроля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументЗакрытия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПервичныйПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/АвтоСтатусыСервер/Ext/Module.bsl
// Пересчитывает автостатусы по одному маршруту (приём + стандарт).
// Перезаписывает соответствующую область регистра АвтоСтатусыПозицийМаршрута.
Процедура ПересчитатьАвтоСтатусыМаршрута(ПервичныйПрием, СтандартЛечения) Экспорт
	
	Если Не ЗначениеЗаполнено(ПервичныйПрием) ИЛИ Не ЗначениеЗаполнено(СтандартЛечения) Тогда
		Возврат;
	КонецЕсли;
	
	// Используем существующий движок отчёта для подготовки таблицы плана с фактом.
	// Берём только до наложения ручных статусов — нам нужен именно автомат.
	ТаблицаПлана = МаршрутыПациентовСервер.ПолучитьПланСЭтапами(ПервичныйПрием, СтандартЛечения);
	МаршрутыПациентовСервер.ПрименитьКорректировки(ТаблицаПлана,
		МаршрутыПациентовСервер.ПолучитьКорректировки(ПервичныйПрием, СтандартЛечения));
	
	Пациент = ПациентПриема(ПервичныйПрием);
	Если ЗначениеЗаполнено(Пациент) Тогда
		ДатаНачалаОкна = НачалоДня(ПервичныйПрием.Дата) - 30 * 86400;
		ИтогМаршрута = МаршрутыПациентовСервер.ПрочитатьИтогЛечения(ПервичныйПрием);
		ДатаОкончанияОкна = ?(ИтогМаршрута <> Неопределено
				И ЗначениеЗаполнено(ИтогМаршрута.ДатаЗакрытия),
			НачалоДня(ИтогМаршрута.ДатаЗакрытия) + 86399,
			КонецДня(ТекущаяДатаСеанса()));
		ТаблицаФакта = МаршрутыПациентовСервер.ПолучитьФакт(Пациент, ДатаНачалаОкна, ДатаОкончанияОкна);
		МаршрутыПациентовСервер.СопоставитьФакт(ТаблицаПлана, ТаблицаФакта);
	КонецЕсли;
	
	// Перезаписываем область регистра по этому маршруту.
	НаборЗаписей = РегистрыСведений.АвтоСтатусыПозицийМаршрута.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПервичныйПрием.Установить(ПервичныйПрием);
	НаборЗаписей.Отбор.СтандартЛечения.Установить(СтандартЛечения);
	
	ТекущаяДата = ТекущаяДатаСеанса();
	Для Каждого СтрокаПлана Из ТаблицаПлана Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.ПервичныйПрием			= ПервичныйПрием;
		Запись.ИдентификаторНазначения	= СтрокаПлана.ИдентификаторНазначения;
		Запись.СтандартЛечения			= СтандартЛечения;
		Запись.Статус					= АвтоСтатусПозиции(СтрокаПлана);
		Запись.ДатаРасчета				= ТекущаяДата;
		Запись.ДатаФакта				= СтрокаПлана.ДатаФакта;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Возвращает строковый автостатус позиции без учёта ручного статуса.
// Это копия логики ветвей "по факту / по плановым датам" из МаршрутыПациентовСервер.СтатусУслуги,
// но без блока приоритета ручного статуса (он теперь живёт отдельно).
Функция АвтоСтатусПозиции(СтрокаПлана) Экспорт
	
	Если СтрокаПлана.Выполнено Тогда
		Возврат "выполнено";
	КонецЕсли;
	
	Если СтрокаПлана.ФактВРаботе Тогда
		Возврат "в работе";
	КонецЕсли;
	
	Сегодня = НачалоДня(ТекущаяДатаСеанса());
	ДатаКонца = ?(ЗначениеЗаполнено(СтрокаПлана.ДатаОкончания),
		НачалоДня(СтрокаПлана.ДатаОкончания), НачалоДня(СтрокаПлана.ДатаНачала));
	
	Если ЗначениеЗаполнено(ДатаКонца) И ДатаКонца < Сегодня Тогда
		Возврат "просрочено";
	КонецЕсли;
	
	ЭтоПериод = ЗначениеЗаполнено(СтрокаПлана.ДатаОкончания)
		И НачалоДня(СтрокаПлана.ДатаОкончания) > НачалоДня(СтрокаПлана.ДатаНачала);
	
	Если ЭтоПериод
			И ЗначениеЗаполнено(СтрокаПлана.ДатаНачала)
			И НачалоДня(СтрокаПлана.ДатаНачала) <= Сегодня Тогда
		Возврат "в работе";
	КонецЕсли;
	
	Возврат "запланировано";
	
КонецФункции

// Пересчитывает автостатусы по ВСЕМ незавершённым маршрутам системы.
// Незавершённый = нет записи в ИтогиЛечения по первичному приёму.
// Вызывается из регламентного задания (шаг Б).
Процедура ПересчитатьАвтоСтатусыВсехНезавершенныхМаршрутов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЭтапыНазначений.ПервичныйПрием КАК ПервичныйПрием,
	|	ЭтапыНазначений.СтандартЛечения КАК СтандартЛечения
	|ИЗ
	|	РегистрСведений.ЭтапыНазначенийПланаЛечения КАК ЭтапыНазначений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИтогиЛечения КАК Итоги
	|		ПО Итоги.ПервичныйПрием = ЭтапыНазначений.ПервичныйПрием
	|ГДЕ
	|	Итоги.ПервичныйПрием ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			ПересчитатьАвтоСтатусыМаршрута(Выборка.ПервичныйПрием, Выборка.СтандартЛечения);
		Исключение
			ЗаписьЖурналаРегистрации(
				"АвтоСтатусыМаршрута.Пересчёт",
				УровеньЖурналаРегистрации.Ошибка, , ,
				"Маршрут " + Строка(Выборка.ПервичныйПрием) + " / "
					+ Строка(Выборка.СтандартЛечения) + ": "
					+ ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Служебная: определяет пациента по приёму (по реквизиту Клиент).
Функция ПациентПриема(Прием)
	
	Если Не ЗначениеЗаполнено(Прием) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Прием, "Клиент");
	
КонецФункции
